app/controllers/countries_controller.rb

  def show
    @country = Country.find(params[:id])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", :id]]

  def create
    @country = Country.new(country_params)

    if @country.save
---
INSERT INTO "countries" ("created_at", "iso2", "iso3", "name", "notes", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 05 Mar 2014 11:33:44 UTC +00:00], ["iso2", "test"], ["iso3", "test"], ["name", "test"], ["notes", "test"], ["updated_at", Wed, 05 Mar 2014 11:33:44 UTC +00:00]]

  def destroy
    @country = Country.find(params[:id])
    @country.destroy
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 1]]